import fetch from 'node-fetch'

let handler = async function (m, { conn, text, usedPrefix }) {
  
let m2 = `╭╸╸╸[💝𝙌𝙐𝙀𝙀𝙉 𝘼𝙇𝙀𝙓𝘼 𝘽𝙊𝙏 𝙈𝘼𝙄𝙉 𝙈𝙀𝙉𝙐💝]╸╸╮

╭╸╸╸╸╸╸╸╸╸╸╸╸╸╸╸╸╮
│💭𝙃𝙄 _%name_ 𝙐𝙎𝙀𝙍💝
│
│    💙𝙃𝙊𝙒 𝘼𝙍𝙀 𝙔𝙊𝙐...💙
│           💙𝙃𝘼𝙑𝙀 𝘼 𝙉𝙄𝘾𝙀💙
│                💙𝘿𝘼𝙔💙
│💜𝘾𝙊𝙈𝙈𝙄𝙉𝙂 𝙎𝙊𝙊𝙉 𝙉𝙀𝙒💜
│         💜𝘾𝙊𝙈𝙈𝘼𝙉𝘿𝙎.....💜
╰╸╸╸╸╸╸╸╸╸╸╸╸╸╸╸╸╯
   ╰▢╸╸╸╸╸╸╸⦁⦁❊⦁⦁╸╸╸╸╸╸▢╯
  ╭╸╸╸╸╸╸╸╸╸╸╸╸╸╮
        💜𝘼𝙇𝙇 𝗠𝗘𝗡𝗨 💜
  ╰╸╸╸╸╸╸╸╸╸╸╸╸╸╯
           ◤𝙈𝘼𝙄𝙉 𝙈𝙀𝙉𝙐◢
➤.𝙮𝙩𝙨
➤.𝙫𝙞𝙙𝙚𝙤
➤.𝙖𝙡𝙚𝙭𝙖
➤.𝙢𝙤𝙙𝙖𝙥𝙠
➤.𝙖𝙞  
➤.𝙜𝙥𝙩4 𝚌𝚘𝚖𝚖𝚒𝚗𝚐 𝚜𝚘𝚘𝚗
➤.𝙛𝙗 
➤.𝙛𝙖𝙘𝙚𝙗𝙤𝙤𝙠
➤.𝙥𝙡𝙖𝙮2
➤.𝙤𝙬𝙣𝙚𝙧
➤.𝙨𝙩𝙞𝙘𝙠𝙚𝙧*
➤.𝙨𝙘𝙧𝙞𝙥𝙩
➤.𝙜𝙤𝙤𝙜𝙡𝙚
➤.𝙢𝙤𝙫𝙞𝙚
          ◤𝘽𝙊𝙏 𝙈𝙀𝙉𝙐◢
➤𝙧𝙪𝙣𝙩𝙞𝙢𝙚
➤.𝙥𝙞𝙣𝙜
         ◤ 𝙉𝙎𝙁𝙒 𝙈𝙀𝙉𝙐◢
➤.𝙣𝙨𝙛𝙬 
➤.𝙭𝙫𝙞𝙙
➤.𝙭𝙭𝙙𝙡

         ◤𝙂𝙍𝙊𝙐𝙋 𝙈𝙀𝙉𝙐◢
➤.𝙩𝙖𝙜𝙖𝙡𝙡
  💭𝙲𝙾𝙾𝙼𝙸𝙽𝙶 𝚂𝙾𝙾𝙽.. 𝙾𝚃𝙷𝙴𝚁𝚂
         ◤𝙇𝙊𝙂𝙊 𝙈𝙀𝙉𝙐◢
  
 𝚃𝚈𝙿𝙴 .𝙶𝙵𝚇1 𝚝𝚘 .𝙶𝙵𝚇12   
  💜.𝘨𝘧𝘹1  
  💜.𝘨𝘧𝘹2 
  💜.𝘨𝘧𝘹3
  💜.𝘨𝘧𝘹4
  💜.𝘨𝘧𝘹5
  💜.𝘨𝘧𝘹6
  💜.𝘨𝘧𝘹7
  💜.𝘨𝘧𝘹8
  💜.𝘨𝘧𝘹9
  💜.𝘨𝘧𝘹10
  💜.𝘨𝘧𝘹11
  💜.𝘨𝘧𝘹12
╭╸╸╸╸╸╸╸╸╸╸╸╸╸╸╸╸╮
│𝘾𝙊𝙈𝙈𝙄𝙉𝙂 𝙎𝙊𝙊𝙉.......
│     𝘽𝙊𝙏 𝙊𝙏𝙃𝙀𝙍 𝘾𝙊𝙈𝙈𝘼𝙉𝘿𝙎
╰╸╸╸╸╸╸╸╸╸╸╸╸╸╸╸╸╯
╭💝𝙏𝙃𝙀 𝙌𝙐𝙀𝙀𝙉 𝘼𝙇𝙀𝙓𝘼 𝘽𝙊𝙏
╰╸╸╸╸╸╸╸╸╸╸╸╸╸╸╸╸╸╸⦁✣ `

    let pp = './src/alexa_logo.jpg' 
    conn.sendFile(m.chat, pp, 'menu.jpg', m2, m, null, rpl)
    m.react('💝') 
}

handler.help = ['menu']
handler.tags = ['main']
handler.command = ['menu', 'panel'] 

export default handler

